app/controllers/api/questions_controller.rb

   def show
	  template_id = params[:template_id]
	  @questions = Template.find(template_id).questions
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
SELECT  "templates".* FROM "templates" WHERE "templates"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]